package com.lab1;

import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class PhoneValidator {
    public static void main(String[] args) {
        String patterns = "^(\\+?380|\\+38|\\+?80)?\\s?(\\(0?\\d{2}\\)|0?\\d{2})[\\s\\-]?\\d{3}([\\s\\-]?\\d{1,4})+$";

        /*
        ^ --> початок рядка
        (\+?380|\+38|\+?80)? --> допускає необов'язковий код країни (тому що стоїть ? перед усією групою) і +380, 380 (тому що ? після +); +38; +80, 80 (тому що ? після +)
        \s? --> допускає 1 необов'язковий пробільний символ/табуляція після коду країни
        (\(0?\d{2}\)|0?\d{2}|) --> допускає код оператора з нулем чи без, в дужках чи без них (0**), (**); 0**, **
        [\s\-]? --> необов'язковий 1 пробільний символ/табуляція або "-" після коду оператора
        \d{3} --> три цифри ***
        ([\s\-]?\d{1,4})+$ --> розпізнає групи від 1 до 4 цифр (\d{1,4}), необов'язково розділених [\s\-], які повторюються один або більше разів (+), до кінця рядка ($)
         */

        String[] validPhoneNumbers
                = {"380505923501", "+380505923501", "+38 050 592 35 01", "+38 (050) 592 35 01", "+38 (050) 592-35-01", "+38 (050) 592-3-501",
                "(050) 592-35-01", "050 592 35 01", "050 592 35 01", "050 592 3501", "050 592 3 501", "050-592-3-501",
                "+80 (50) 592 35 01", "380 (50) 592 35 01", "+380 (50) 592 35 01", "+380 (50) 592 35 01", "+380 (50) 592-35-01", "+380 50 592-35-01",
        };

        Pattern pattern = Pattern.compile(patterns);

        int count = 1;
        for (String phoneNumber : validPhoneNumbers) {
            Matcher matcher = pattern.matcher(phoneNumber);

            System.out.printf(
                    "№%-5d Номер: %-25s %s%n",
                    count++, // порядковий номер (%d)
                    phoneNumber, // номер телефону (%-25s)
                    (matcher.matches() ? "валідний" : "не валідний") // cтатус (%s)
            );
        }
    }
}